### 4. 데이터프레임 데이터 조작

In [78]:
import numpy as np 
import pandas as pd

- 데이터 갯수 세기

In [79]:
# np.random.seed(2)
# df = pd.DataFrame(np.random.randint(5, size=(4,4)), dtype=float)
# df.iloc[2,3] = np.nan
# df

In [80]:
# df.count()

In [81]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [82]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

- 연습 문제 4.4.1

In [83]:
# 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기

In [84]:
# 열 별로 센다
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [85]:
titanic['embark_town'].value_counts()

Southampton    644
Cherbourg      168
Queenstown      77
Name: embark_town, dtype: int64

- 정렬

In [86]:
np.random.seed = 2023
df = pd.DataFrame(np.random.randint(40, 101, size=(4,5)), 
                    columns=list('VWXYZ'), index=list('abcd') )
df.V.b = df.V.d
df

    V   W   X   Y   Z
a  87  58  60  64  99
b  84  54  70  79  40
c  73  45  54  92  76
d  84  40  83  62  91

In [87]:
df['V'].sort_values(ascending=False)

a    87
b    84
d    84
c    73
Name: V, dtype: int32

In [88]:
df.sort_values('V')

    V   W   X   Y   Z
c  73  45  54  92  76
b  84  54  70  79  40
d  84  40  83  62  91
a  87  58  60  64  99

In [89]:
df.sort_values(by='V', ascending=False)

    V   W   X   Y   Z
a  87  58  60  64  99
b  84  54  70  79  40
d  84  40  83  62  91
c  73  45  54  92  76

In [90]:
# V 열에 동일한 값이 있으면, 동일한 값은 X 열을 보고 정렬
df.sort_values(by=['V', 'X'], ascending=False)

    V   W   X   Y   Z
a  87  58  60  64  99
d  84  40  83  62  91
b  84  54  70  79  40
c  73  45  54  92  76

- 연습 문제 4.4.2

In [91]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [92]:
print(titanic['sex'].value_counts())

male      577
female    314
Name: sex, dtype: int64

In [93]:
titanic['age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
28.00    25
         ..
36.50     1
55.50     1
0.92      1
23.50     1
74.00     1
Name: age, Length: 88, dtype: int64

In [94]:
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [95]:
titanic['class'].value_counts().sort_index()

First     216
Second    184
Third     491
Name: class, dtype: int64

In [96]:
titanic['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

- 행/열 합계

In [97]:
df

    V   W   X   Y   Z
a  87  58  60  64  99
b  84  54  70  79  40
c  73  45  54  92  76
d  84  40  83  62  91

In [98]:
df.iloc[:, :].mean(axis=0)

V    82.00
W    49.25
X    66.75
Y    74.25
Z    76.50
dtype: float64

In [99]:
# 행 방향(열의 합계)
df.sum(axis=0)

V    328
W    197
X    267
Y    297
Z    306
dtype: int64

In [100]:
# 열 방향(행의 합계)
df.sum(axis=1)

a    368
b    327
c    340
d    360
dtype: int64

In [101]:
# 총점 열 만들기
df['총점'] = df.sum(axis=1)
df

    V   W   X   Y   Z   총점
a  87  58  60  64  99  368
b  84  54  70  79  40  327
c  73  45  54  92  76  340
d  84  40  83  62  91  360

In [102]:
# 평균 열 만들기
df['평균'] = df[['V', 'W', 'X', 'Y', 'Z']].mean(axis=1)
df

    V   W   X   Y   Z   총점    평균
a  87  58  60  64  99  368  73.6
b  84  54  70  79  40  327  65.4
c  73  45  54  92  76  340  68.0
d  84  40  83  62  91  360  72.0

In [103]:
df['평균'] = df.iloc[:, :5].mean(axis=1)
df

    V   W   X   Y   Z   총점    평균
a  87  58  60  64  99  368  73.6
b  84  54  70  79  40  327  65.4
c  73  45  54  92  76  340  68.0
d  84  40  83  62  91  360  72.0

- 연습 문제 4.4.3

In [104]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [105]:
# 평균 나이
np.round(titanic['age'].mean(), 2)

29.7

In [106]:
# 여성 승객의 평균 나이
np.round(titanic[titanic.sex=='female']['age'].mean(), 2)

27.92

In [107]:
# 1등실 선실의 여성 승객의 평균 나이
np.round(titanic[(titanic['class']=='First') & (titanic.sex=='female')].age.mean(), 1)
# titanic[(titanic.pclass==1) & (titanic.sex=='female')].age.mean().round(1)

34.6

- apply 변환

In [108]:
titanic.apply(lambda x: x.count())

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [109]:
df

    V   W   X   Y   Z   총점    평균
a  87  58  60  64  99  368  73.6
b  84  54  70  79  40  327  65.4
c  73  45  54  92  76  340  68.0
d  84  40  83  62  91  360  72.0

In [110]:
# 각 열에서 최대값 - 최소값 한 결과
df.apply(lambda x: x.max() - x.min())  # x는 각 column을 의미

V     14.0
W     18.0
X     29.0
Y     30.0
Z     59.0
총점    41.0
평균     8.2
dtype: float64

In [111]:
# V 열에서 제곱수
df.V.apply(lambda x: x * x)    # x는 한 컬럼의 원소를 의미

a    7569
b    7056
c    5329
d    7056
Name: V, dtype: int64

In [112]:
# 타이타닉호의 승객 중 나이 20살을 기준으로 성인(adult)과 미성년자(child)를 구별하는 라벨 열

titanic['adult/child'] = titanic.age.apply(lambda x: 'adult' if x >= 20 else 'child')
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult

In [113]:
data = { 
    'price' : ['1,200', '2,500', '3,300'],
    'text' : ['03.입출력.ipynb', '04.고급인덱싱.ipynb', '05.데이터조작.ipynb']
    }
df3 = pd.DataFrame(data)
df3

   price            text
0  1,200    03.입출력.ipynb
1  2,500  04.고급인덱싱.ipynb
2  3,300  05.데이터조작.ipynb

In [114]:
int('1,200'.replace(',', ''))

1200

In [115]:
df3['정수'] = df3.price.apply(lambda x: int(x.replace(',','')))
df3

   price            text    정수
0  1,200    03.입출력.ipynb  1200
1  2,500  04.고급인덱싱.ipynb  2500
2  3,300  05.데이터조작.ipynb  3300

In [116]:
df3['구둣점제거'] = df3.text.apply(lambda x: x.replace('.', ''))
df3

   price            text    정수         구둣점제거
0  1,200    03.입출력.ipynb  1200    03입출력ipynb
1  2,500  04.고급인덱싱.ipynb  2500  04고급인덱싱ipynb
2  3,300  05.데이터조작.ipynb  3300  05데이터조작ipynb

In [117]:
df3['한글제거'] = df3.text.replace('[ㄱ-ㅎㅏ-ㅣ가-힣]','', regex=True)
df3

   price            text    정수         구둣점제거       한글제거
0  1,200    03.입출력.ipynb  1200    03입출력ipynb  03..ipynb
1  2,500  04.고급인덱싱.ipynb  2500  04고급인덱싱ipynb  04..ipynb
2  3,300  05.데이터조작.ipynb  3300  05데이터조작ipynb  05..ipynb

- 연습 문제 4.4.4

In [118]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult

In [119]:
titanic['category1'] = titanic.apply(lambda x: x.sex if x.age >= 20 else 'child', axis=1)
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True,adult,male
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True,child,child
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False,child,child
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True,adult,male
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True,adult,male

In [120]:
cat2 = []
for i in titanic.index:
    if titanic.age[i] > 20:
        cat2.append(titanic.sex[i])
    else:
        cat2.append('child')

titanic['cat2'] = cat2
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,adult/child,category1,cat2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult,male,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,adult,female,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,adult,female,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,adult,female,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,adult,male,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,adult,male,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,child,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,child,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,adult,male,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,adult,male,male

- 결측치 처리

In [127]:
dt = sns.load_dataset('titanic')
print(dt.shape)
dt.head(3)

(891, 15)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [128]:
# 어느 열에 결측치 있는지 확인
dt.isna().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [129]:
# 전체에서 결측치가 있는지 확인
dt.isna().sum().sum()

869

In [130]:
# deck 결측치가 너무 많아서 컬럼 삭제
# del dt['deck']
dt.drop(columns=['deck'], inplace=True)
dt.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True

In [132]:
# age 결측치는 평균으로 대체
dt.age.fillna(round(dt.age.mean(), 2), inplace=True)
dt.tail(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
888,0,3,female,29.7,1,2,23.45,S,Third,woman,False,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,Queenstown,no,True

In [133]:
# embarked 결측치는 최빈값으로 대체
dt.embarked.value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [134]:
dt.embarked.fillna('S', inplace=True)
dt.embarked.value_counts()

S    646
C    168
Q     77
Name: embarked, dtype: int64

In [135]:
dt[dt.embark_town.isna()]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,S,First,woman,False,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,S,First,woman,False,NaN,yes,True

In [136]:
dt.isna().sum()

survived       0
pclass         0
sex            0
age            0
sibsp          0
parch          0
fare           0
embarked       0
class          0
who            0
adult_male     0
embark_town    2
alive          0
alone          0
dtype: int64

In [137]:
dt.dropna(subset=['embark_town'], inplace=True)

In [138]:
dt.isna().sum().sum()

0

In [139]:
dt.shape

(889, 14)

- astype

In [142]:
data = {
    'price1': ['1200', '2400', '3600'],
    'price2': ['1,200', '2,400', '3,600']
}
df4 = pd.DataFrame(data)
df4

  price1 price2
0   1200  1,200
1   2400  2,400
2   3600  3,600

In [143]:
type(df4.price1[0]), type(df4.price2[0])

(str, str)

In [144]:
df4['int1'] = df4.price1.astype(int)
df4

  price1 price2  int1
0   1200  1,200  1200
1   2400  2,400  2400
2   3600  3,600  3600

In [ ]:
type(df4.price1[0]), type(df4.int1[0])

(str, numpy.int32)

In [149]:
df4['int2'] = df4.price2.apply(lambda x: int(x.replace(',','')))
df4

  price1 price2  int1  int3  int2
0   1200  1,200  1200  1200  1200
1   2400  2,400  2400  2400  2400
2   3600  3,600  3600  3600  3600

In [150]:
df4['int3'] = df4.price2.str.replace(',','').astype(int)
df4

  price1 price2  int1  int3  int2
0   1200  1,200  1200  1200  1200
1   2400  2,400  2400  2400  2400
2   3600  3,600  3600  3600  3600

In [151]:
type(df4.price1[0]), type(df4.int1[0]), type(df4.int2[0]),type(df4.int3[0])

(str, numpy.int32, numpy.int64, numpy.int32)

- 실수 값을 카테고리 값으로 변환

In [ ]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]

In [ ]:
bins = [1, 20, 30, 50, 70, 100]     # 1 < 미성년자 <= 20
labels = ["미성년자", "청년", "중년", "장년", "노년"]
cats = pd.cut(ages, bins, labels=labels)
cats

[NaN, '미성년자', '미성년자', '청년', '청년', ..., '장년', '미성년자', '중년', '중년', NaN]
Length: 12
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [ ]:
df5 = pd.DataFrame(ages, columns=["ages"])
df5["age_cat"] = pd.cut(df5.ages, bins, labels=labels)
df5

    ages age_cat
0      0     NaN
1      2    미성년자
2     10    미성년자
3     21      청년
4     23      청년
5     37      중년
6     31      중년
7     61      장년
8     20    미성년자
9     41      중년
10    32      중년
11   101     NaN

In [ ]:
type(df5.age_cat[2])

str

In [ ]:
df5['one_over_n'] = pd.qcut(ages, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
df5

    ages age_cat one_over_n
0      0     NaN         Q1
1      2    미성년자         Q1
2     10    미성년자         Q1
3     21      청년         Q2
4     23      청년         Q2
5     37      중년         Q3
6     31      중년         Q3
7     61      장년         Q4
8     20    미성년자         Q2
9     41      중년         Q4
10    32      중년         Q3
11   101     NaN         Q4

In [ ]:
df5.sort_values('ages')

    ages age_cat one_over_n
0      0     NaN         Q1
1      2    미성년자         Q1
2     10    미성년자         Q1
8     20    미성년자         Q2
3     21      청년         Q2
4     23      청년         Q2
6     31      중년         Q3
10    32      중년         Q3
5     37      중년         Q3
9     41      중년         Q4
7     61      장년         Q4
11   101     NaN         Q4